Ekpenyong-Esu/TM4C129ENCPDT_CMAKE_PROJET/src/startup.c
static void MemManage_Handler(void) {

    //
    // Enter an infinite loop.
    //
    while (1) {
    }
}
static void BusFault_Handler(void) {

    //
    // Enter an infinite loop.
    //
    while (1) {
    }
}
static void UsageFault_Handler(void) {

    //
    // Enter an infinite loop.
    //
    while (1) {
    }
}

static void NMI_Handler(void) {
    //
    // Enter an infinite loop.
    //
    while (1) {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a fault
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
static void HardFault_Handler(void) {
    //
    // Enter an infinite loop.
    //
    while (1) {
    }
}

//*********** DisableInterrupts ***************
// disable interrupts
// inputs:  none
// outputs: none
void DisableInterrupts(void) {
    __asm("    CPSID  I\n");
}

//*********** EnableInterrupts ***************
// emable interrupts
// inputs:  none
// outputs: none
void EnableInterrupts(void) {
    __asm("    CPSIE  I\n");
}
//*********** StartCritical ************************
// make a copy of previous I bit, disable interrupts
// inputs:  none
// outputs: previous I bit
void StartCritical(void) {
    __asm("    MRS    R0, PRIMASK\n"
          "    CPSID  I         \n");
}

//*********** EndCritical ************************
// using the copy of previous I bit, restore I bit to previous value
// inputs:  previous I bit
// outputs: none
void EndCritical(void) {
    __asm("    MSR    PRIMASK, R0\n");
}

//*********** WaitForInterrupt ************************
// go to low power mode while waiting for the next interrupt
// inputs:  none
// outputs: none
void WaitForInterrupt(void) {
    __asm("    WFI\n");
}
